#+TITLE: Org Settings
#+OPTIONS: toc:nil num:nil ^:nil

*** org-babel使用杂记

    =org-babel= 是org-mode 的一部分,用来管理org文档中的源码,org-babel支
    持多种语言。

    =org-babel= 可以在org文档中插入代码,并且会帮你语法高亮插入的代码,而
    且可以执行你插入的代码,捕获输出,插入到你代码的下面。

    #+BEGIN_SRC sh :exports both :results output
        echo ";;This is a Test"
    #+END_SRC

    #+RESULTS:
    : ;;This is a Test

    #+RESULTS

    导出时不执行代码：  

    #+BEGIN_SRC sh  :exports both :results output :eval no-export
       echo ";;This is a Test"
    #+END_SRC

